#ifndef CHESSTABLE_H_INCLUDED
#define CHESSTABLE_H_INCLUDED
#include<iostream>
using namespace std;
class ChessTable
{
  private:
    char Chess[15][45]={
    "©³ ©× ©× ©× ©× ©× ©× ©× ©× ©× ©× ©× ©× ©× ©·",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©Ç ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©à ©Ï",
    "©» ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©ß ©¿"
    };
  public:
    void Display();
};
#endif // CHESSTABLE_H_INCLUDED
